tap "nikitabobko/tap"
tap "ognistik/homebrew-formulae"
tap "oven-sh/bun"
brew "whisper-cpp"
brew "ffmpeg"
brew "oven-sh/bun/bun"
brew "python"  # Includes pip by default
brew "uv"      # Fast Python package installer and resolver
brew "pipx"    # Install Python CLI tools in isolated environments
brew "pyenv"   # Python version manager
brew "m4"      # GNU macro processor (needed by autoconf)
brew "autoconf"  # Tool for generating configure scripts
brew "aider"   # AI pair programming CLI tool
brew "docker"
brew "colima"    # lightweight VM for running containers (better on macOS)
brew "docker-compose"
brew "tmux"
brew "zoxide"
brew "tmuxinator"
brew "atuin"
brew "az"
brew "hl"
brew "lnav"
brew "pnpm"
brew "poppler"   # PDF utilities including pdftotext
brew "ripgrep"
brew "awscli"
brew "bat"
brew "blueutil"
brew "coreutils"
brew "bats-core"
brew "eza"
brew "fd"
brew "flyctl"
brew "fzf"
brew "gh"
brew "ghq"
brew "git-delta"
brew "git-filter-repo"
brew "grep"
brew "ast-grep"
brew "jq"
brew "yq"
brew "lazygit"
brew "fnm"
brew "shfmt"
brew "shellcheck"
brew "actionlint"
brew "yamllint"
brew "yarn"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "wget"
cask "betterdisplay"
cask "cleanmymac"
cask "karabiner-elements"
cask "raycast"
cask "visual-studio-code"
cask "aldente"
cask "discord"
cask "firefox"
cask "imazing"
cask "postman"
cask "slack"
cask "zoom"
cask "gcloud-cli"
cask "notion"
cask "notion-calendar"
cask "microsoft-teams"
cask "microsoft-outlook"
cask "ghostty"
cask "chatgpt"
cask "google-chrome"
cask "1password"
cask "1password-cli"
cask "claude"
cask "iterm2"
cask "superwhisper"
brew "ognistik/homebrew-formulae/macrowhisper"
cask "ollama-app"
cask "obsidian"
cask "docker-desktop"
cask "claude-code"
cask "raspberry-pi-imager"
cask "superhuman"
cask "codex"
