acomagu/fish-async-prompt
jhillyerd/plugin-git
edc/bass
jethrokuan/z
rafaelrinaldi/pure
jorgebucaran/fisher
patrickf1/fzf.fish
jorgebucaran/nvm.fish
